Revit 2024 API
LineProperties.Transparency Property
 The current transparency level to be applied to the current color.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public int Transparency { get; }
Visual Basic
Public ReadOnly Property Transparency As Integer
	Get
Visual C++
public:
property int Transparency {
	int get ();
}
See Also
LineProperties Class
Autodesk.Revit.DB Namespace